In [2]:
dict={"cal":[1,2,3],"bambu":[6,7,8],"poiu":[35,876,432]}
import pandas as pd
data=pd.DataFrame(dict, index=[0,1,2])
print(data)

   cal  bambu  poiu
0    1      6    35
1    2      7   876
2    3      8   432

In [6]:
print(data.loc[0])

cal       1
bambu     6
poiu     35
Name: 0, dtype: int64

In [11]:
vdict={"cal":[1,2,3],"bambu":[6,7,8],"poiu":[35,876,432]}
df=pd.DataFrame(vdict)
print(df.loc[[0,1]])

   cal  bambu  poiu
0    1      6    35
1    2      7   876

In [2]:
import numpy as np

In [10]:
from numpy.random import randn
import pandas as pd
d=pd.DataFrame(randn(5,4), ['a','b','c','d','e'],['q','w','e','r'])
d

          q         w         e         r
a  0.220654  2.439283  0.147577 -1.654810
b -0.465229 -0.105352  0.207701 -0.066256
c -0.830637 -0.331089  0.454139 -1.264396
d -1.031037 -0.437447  0.207916 -0.820390
e  2.779716  0.764257 -0.279611  0.722538

In [12]:
d[['q','e']]

          q         e
a  0.220654  0.147577
b -0.465229  0.207701
c -0.830637  0.454139
d -1.031037  0.207916
e  2.779716 -0.279611

In [13]:
d['new_col']=d['q']+d['w']
d

          q         w         e         r   new_col
a  0.220654  2.439283  0.147577 -1.654810  2.659937
b -0.465229 -0.105352  0.207701 -0.066256 -0.570580
c -0.830637 -0.331089  0.454139 -1.264396 -1.161726
d -1.031037 -0.437447  0.207916 -0.820390 -1.468484
e  2.779716  0.764257 -0.279611  0.722538  3.543974

In [14]:
d.drop('w', axis=1)

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580
c -0.830637  0.454139 -1.264396 -1.161726
d -1.031037  0.207916 -0.820390 -1.468484
e  2.779716 -0.279611  0.722538  3.543974

In [15]:
d.drop('w',axis=1,inplace=True)

In [16]:
d

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580
c -0.830637  0.454139 -1.264396 -1.161726
d -1.031037  0.207916 -0.820390 -1.468484
e  2.779716 -0.279611  0.722538  3.543974

In [17]:
d.drop('c',axis=0,inplace=True)
d

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580
d -1.031037  0.207916 -0.820390 -1.468484
e  2.779716 -0.279611  0.722538  3.543974

In [19]:
d.loc['a']

q          0.220654
e          0.147577
r         -1.654810
new_col    2.659937
Name: a, dtype: float64

In [20]:
d.iloc[0]

q          0.220654
e          0.147577
r         -1.654810
new_col    2.659937
Name: a, dtype: float64

In [21]:
d.loc[['a','d']]

          q         e        r   new_col
a  0.220654  0.147577 -1.65481  2.659937
d -1.031037  0.207916 -0.82039 -1.468484

In [22]:
d.iloc[0,1]

0.14757701668665898

In [23]:
d.loc['a','e']

0.14757701668665898

In [24]:
d.iloc[[0,1,2]]

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580
d -1.031037  0.207916 -0.820390 -1.468484

In [26]:
d.iloc[0:2]

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580

In [27]:
d[0:2]

          q         e         r   new_col
a  0.220654  0.147577 -1.654810  2.659937
b -0.465229  0.207701 -0.066256 -0.570580

In [31]:
d.loc[['a','d'],['q','new_col']]

          q   new_col
a  0.220654  2.659937
d -1.031037 -1.468484

In [32]:
df=pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

Conditional Selection

In [33]:
df

          W         X         Y         Z
A -0.865655  0.443879  0.999572  1.066568
B -2.168414 -0.845159 -0.174081  1.199194
C -0.922918 -0.792802 -0.992614 -0.619387
D  0.244174 -1.174546  1.192198 -1.628950
E  0.939317 -0.634943 -0.794461 -0.737639

In [34]:
df>0

       W      X      Y      Z
A  False   True   True   True
B  False  False  False   True
C  False  False  False  False
D   True  False   True  False
E   True  False  False  False

In [36]:
df[df>0]

          W         X         Y         Z
A       NaN  0.443879  0.999572  1.066568
B       NaN       NaN       NaN  1.199194
C       NaN       NaN       NaN       NaN
D  0.244174       NaN  1.192198       NaN
E  0.939317       NaN       NaN       NaN

In [37]:
df['W']>0

A    False
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [38]:
df[df['W']>0]

          W         X         Y         Z
D  0.244174 -1.174546  1.192198 -1.628950
E  0.939317 -0.634943 -0.794461 -0.737639

In [40]:
result=df[df['W']>0]
result['X']

D   -1.174546
E   -0.634943
Name: X, dtype: float64

In [42]:
df[df['W']>0]['X']

D   -1.174546
E   -0.634943
Name: X, dtype: float64

In [43]:
df[df['W']>0][['X','Z']]

          X         Z
D -1.174546 -1.628950
E -0.634943 -0.737639

In [44]:
df.reset_index() #we have to put inplace=True for perm change

  index         W         X         Y         Z
0     A -0.865655  0.443879  0.999572  1.066568
1     B -2.168414 -0.845159 -0.174081  1.199194
2     C -0.922918 -0.792802 -0.992614 -0.619387
3     D  0.244174 -1.174546  1.192198 -1.628950
4     E  0.939317 -0.634943 -0.794461 -0.737639

In [45]:
df['States']='AP TN WB ND BR'.split()
df

          W         X         Y         Z States
A -0.865655  0.443879  0.999572  1.066568     AP
B -2.168414 -0.845159 -0.174081  1.199194     TN
C -0.922918 -0.792802 -0.992614 -0.619387     WB
D  0.244174 -1.174546  1.192198 -1.628950     ND
E  0.939317 -0.634943 -0.794461 -0.737639     BR

In [46]:
df.set_index('States')  #we have to put inplace=True for perm change

               W         X         Y         Z
States
AP     -0.865655  0.443879  0.999572  1.066568
TN     -2.168414 -0.845159 -0.174081  1.199194
WB     -0.922918 -0.792802 -0.992614 -0.619387
ND      0.244174 -1.174546  1.192198 -1.628950
BR      0.939317 -0.634943 -0.794461 -0.737639

In [50]:
inside=[1,2,3,1,2,3]
outside='G1 G1 G1 G2 G2 G2'.split()
h=list(zip(outside,inside))
h

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [51]:
p=pd.MultiIndex.from_tuples(h)
p

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df=pd.DataFrame(randn(6,2),p,['A','B'])
df

             A         B
G1 1 -1.734386  0.022516
   2 -0.511716  0.661601
   3 -0.641719 -1.302194
G2 1  0.378785  0.898374
   2 -2.221350  0.494281
   3  0.150716  0.153158

In [59]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1   -1.734386  0.022516
       2   -0.511716  0.661601
       3   -0.641719 -1.302194
G2     1    0.378785  0.898374
       2   -2.221350  0.494281
       3    0.150716  0.153158

In [60]:
df.loc['G1']

            A         B
Num
1   -1.734386  0.022516
2   -0.511716  0.661601
3   -0.641719 -1.302194

In [61]:
df.loc['G1'].loc[2]

A   -0.511716
B    0.661601
Name: 2, dtype: float64

In [62]:
df.loc['G1'].loc[2]['B']

0.6616008132949714

In [63]:
df.xs('G1')

            A         B
Num
1   -1.734386  0.022516
2   -0.511716  0.661601
3   -0.641719 -1.302194

In [65]:
df.xs(1,level='Num')

               A         B
Groups
G1     -1.734386  0.022516
G2      0.378785  0.898374

In [66]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)

In [67]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [68]:
df.dropna() #by default axis=0 i.e. rows will be deleted

     A    B  C
0  1.0  5.0  1

In [69]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [70]:
df.dropna(thresh=2)  #if row has atleast 2 non na values then it wont be droped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [71]:
df.fillna(value='fill')

      A     B  C
0     1     5  1
1     2  fill  2
2  fill  fill  3

In [73]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [74]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [76]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [77]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000